Repository: me-gusta/telegram_bot_mines
Catalog: files/locales/*/LC_MESSAGES/mybot.po
Languages: ru

source: 🆕 We are updating the bot now. ⏰ Please try again later. 🙏🏻 Sorry for inconvenience. Use this command to open the menu 👉🏻 /menu
ru: 🆕 Мы сейчас работает над обновление. ⏰ Пожалуйста, попробуйте позже. 🙏🏻 Простите за неудобства. Вы можете использовать эту команду, чтобы открыть меню 👉🏻 /menu

source: Back
ru: Назад

source: Choose an Option
ru: Выберите пункт

source: Main Menu
ru: Главное Меню

source: Please contact our support for details or try again.
ru: Пожалуйста, свяжитесь с нашей службой поддержки для получения более подробной информации или повторите попытку.

source: Support
ru: Поддержка

source: 😐 *Oops....* Something unexpected happened.
ru: 😐 *Упс....* Произошла какая-то ошибка.

source: 🍀 Try your luck and win TON with me!
ru: 🍀 Испытай свою удачу и выигрывай криптовалюту TON вместе со мной!

source: Invite Friend
ru: Пригласить друга

source: Confirmation
ru: Подтвердить

source: Are you sure you want to {msg}?
ru: Вы уверены, что хотите {msg}

source: Confirm
ru: Подтвердить

source: input {amount} TON
ru: ввести {amount} TON

source: {error}{text}Limits: • Minimum: {min} • Maximum: {max}
ru: {error}{text}Лимиты: • Минимум: {min} • Максимум: {max}

source: The entered value is not a number.
ru: Пожалуйста, введите число

source: The entered number is less than the minimum.
ru: Введенное число меньше минимального.

source: The entered number is greater than the maximum.
ru: Введенное число больше максимального.

source: Games
ru: Игры

source: Choose a Game
ru: Выберите игру

source: 💣 *Mines*: Uncover all diamonds to maximize your profit! 💸 *Coinflip*: _[soon]_ Simple 50-50 game of chance. 🚀 *Rocket Launch*: _[soon]_ Hop on a starship and earn up to x10000! _You can play every game for free if you set your bet to 0_
ru: 🕹️ Игры 💣 *Мины*: Откройте все алмазы, чтобы увеличить выигрыш! 💸 *Монетка*: _[soon]_ Простая игра 50 на 50. 🚀 *Ракета*: _[soon]_ Успей забрать выигрыш, пока ракета не рухнула! _Вы можете играть в каждую игру бесплатно, если установите свою ставку равной 0_

source: Mines
ru: Мины

source: Coinflip
ru: Монетка

source: Rocket Launch
ru: Ракета

source: This game is still in development. Subscribe to our 📰 News to get notified!
ru: Эта игра все еще находится в разработке. Подпишитесь на наши новости 📰, чтобы получить уведомление о выходе!

source: hello
ru: привет

source: you look great today
ru: вы сегодня отлично выглядите

source: nice to see you again
ru: так приятно видеть вас снова

source: have a nice day
ru: добрый день

source: good luck
ru: удачи

source: 🖐 {welcome}, {name}! 👛 Your balance: {balance} 💎
ru: {welcome}, {name}! _Ваш баланс_: {balance} 💎

source: *You have deposit bonus +{bonus}%*
ru: *У вас есть бонус к депозиту +{bonus}%*

source: News
ru: Новости

source: Referral Program Rules
ru: Правила реферальной программы

source: Invite your friends and earn up to *15%* of their bets! Your referrals will get +10% to their first deposit.
ru: Приглашайте своих друзей и зарабатывайте до *15%* от их ставок! Ваши рефералы получат +10% к своему первому первому депозиту.

source: The more people use your invite code, the more percent from their bets you will get. 3% — Total deposit of referrals 0-50 TON + 5 active referrals 4% — Total deposit of referrals 50-125 TON + 15 active referrals 5% — Total deposit of referrals 125-225 TON + 20 active referrals 6% — Total deposit of referrals 225-350 TON + 25 active referrals 7% — Total deposit of referrals 350-500 TON + 30 active referrals 8% — Total deposit of referrals 500-700 TON + 30 active referrals 9% — Total deposit of referrals 700-1000 TON + 30 active referrals 10% — Total deposit of referrals 1000-2000 TON + 30 active referrals
ru: Чем больше людей используют ваш пригласительный код, тем больший процент от их ставок вы получите. 3% — Общий депозит рефералов 0-50 TON + 5 активных рефералов 4% — Общий депозит рефералов 50-125 TON + 15 активных рефералов 5% — Общий депозит рефералов 125-225 TON + 20 активных рефералов 6% — Общий депозит рефералов 225-350 TON + 25 активных рефералов 7% — Общий депозит рефералов 350-500 TON + 30 активных рефералов 8% — Общий депозит рефералов 500-700 TON + 30 активных рефералов 9% — Общий депозит рефералов 700-1000 TON + 30 активных рефералов 10% — Общий депозит рефералов 1000-2000 TON + 30 активных рефералов

source: _Active referral is someone who plays at least once a week_ _Cheating, botting and other malicious actions related to the referral system would not be tolerated._ If you are a content maker and have a large audience get in touch with us. We can discuss special referral program with a bigger share up to 15%
ru: _Активный реферал это тот, кто играет как минимум раз в неделю_ _Мошенничество, использование ботов и другие вредоносные действия, связанные с реферальной системой, недопустимы._ Если вы создаете контент и у вас большая аудитория, свяжитесь с нами. Мы можем обсудить специальную реферальную программу с большей долей до 15%

source: Contact Us
ru: Связаться с нами

source: Invite a friend
ru: Пригласить друга

source: Withdraw
ru: Вывести

source: ⚠ Your withdrawal request is being processed ⚠ Withdrawals can take up to 24h ⚠ Conversion rate: 1 💎 = 1 TON
ru: Запрос на вывод средств обрабатывается ⚠ Обработка может занять до 24 часов⚠ Курс конвертации: 1 💎 = 1 TON

source: Nothing to withdraw
ru: Недостаточно средств для вывода

source: You can not withdraw your referrals balance until you invite 5 active referrals.
ru: Вы не можете вывести свой реферальный баланс, пока не пригласите 5 активных рефералов.

source: Referral Program
ru: Реферальная программа

source: Invite your friends and earn up to *15%* of all their winning and losing bets! Your referrals will get +10% to their first first deposit. Your share: {share}% Active referrals: {count} Referrals deposit: {sum_deposit} Total income: {balance} 💎 Invite link: `https://t.me/LuckyTonBot?start={ref}`
ru: Приглашайте друзей и получайте до *15%* от их выигрышных и проигрышных ставок Ваш процент: {share}% Активные рефералы: {count} Депозит рефералов: {sum_deposit} Заработок: {balance} 💎 Ссылка для приглашения: `https://t.me/LuckyTonBot?start={ref}`

source: Settings
ru: Настройки

source: You can customize bot settings here
ru: Вы можете изменить настройки бота.

source: Change Language
ru: Изменить язык

source: Deposit via @CryptoBot
ru: Пополнить через @CryptoBot

source: You are depositing {amount} TON to your wallet To finish the payment: 1. Press "💳 Go to Payment" 2. Press "START" 3. Follow @CryptoBot instructions
ru: Вы собираетесь пополнить кошелек на {amount} TON Чтобы завершить оплату: 1. Нажмите "💳 Перейти к оплате" 2. Нажмите "НАЧАТЬ" 3. Следуйте инструкциям в @CryptoBot

source: Go to Payment
ru: Перейти к оплате

source: Deposit
ru: Пополнить

source: Please enter or choose the amount for deposit.
ru: Пожалуйста, введите или выберите сумму для внесения депозита.

source: deposit {amount} TON
ru: пополнить баланс на {amount} 💎!

source: ⚠ Right now we only accept deposit via @CryptoBot ⚠ Conversion rate: 1 TON = 1 💎
ru: ⚠ Сейчас мы принимаем депозиты только через @CryptoBot ⚠ Курс конвертации: 1 TON = 1 💎

source: ℹ How to use @CryptoBot
ru: ℹ Как использовать @CryptoBot

source: ❌ Your withdrawal request has been declined. Reason: not enough funds in your wallet
ru: ❌ Ваш запрос на вывод средств был отклонен. Причина: не достаточно средств в вашем кошельке

source: ❌ Your withdrawal request has been declined. Reason: you need to play at least 5 payed games to unlock withdrawals You played: {amount} games out of 5
ru: ❌ Ваш запрос на вывод средств был отклонен. Причина: вам нужно сыграть как минимум в 5 платных игр, чтобы разблокировать вывод средств Вы сыграли: {amount} игр из 5

source: ✅ Your withdrawal request has been processed. {amount} 💎 sent to you wallet
ru: ✅ Ваш запрос на вывод средств был обработан. {amount} 💎 отправлено на ваш кошелек

source: About withdrawals
ru: Правила вывода

source: ⚠ Withdrawals can take up to 24h ⚠ Minimum amount: 0.5 💎 ⚠ Maximum amount: 1000 💎 ⚠ You need to play at least 5 payed games to unlock withdrawals ⚠ You can still use your funds while withdrawal request is pending
ru: ⚠ Вывод средств может занять до 24 часов ⚠ Минимальная сумма: 0.5 💎 ⚠ Максимальная сумма: 1000 💎 ⚠ Вам нужно сыграть как минимум 5 платных игр, чтобы разблокировать вывод средств ⚠ Вы все еще можете использовать свои средства, пока запрос на вывод средств находится на рассмотрении

source: Withdrawal Request
ru: Запрос на вывод средств

source: Please enter or choose the amount for withdrawal.
ru: Пожалуйста, введите или выберите сумму для вывода.

source: withdraw {amount} TON
ru: вывести {amount} TON

source: 👛 Your Balance: {balance} 💎
ru: 👛 Ваш баланс: {balance} 💎

source: Sorry, your balance is less than the required minimum for withdrawal.
ru: К сожалению, ваш баланс меньше необходимого минимума для вывода средств.

source: Your balance is less than the entered amount
ru: Ваш баланс меньше введенной суммы

source: You deposited {amount} 💎 to you wallet!
ru: Вы пополнили баланс на {amount} 💎!
